tap "antoniorodr/memo"
tap "aws/tap"
tap "ekristen/tap"
tap "go-task/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jurplel/tap"
tap "koekeishiya/formulae"
tap "nats-io/nats-tools"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "psviderski/tap"
tap "showwin/speedtest"
# Core application library for C
brew "glib"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Email client that runs in your terminal
brew "aerc"
# Simple, modern, secure file encryption
brew "age"
# Mozilla CA bundle for Python
brew "certifi"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible", link: false
# Lightweight and flexible command-line JSON processor
brew "jq"
# Weather in your terminal, with ANSI colors and Unicode symbols
brew "ansiweather"
# Get stuff done with container-native workflows for Kubernetes
brew "argo"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Python code formatter
brew "black"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# CloudFlare's PKI toolkit
brew "cfssl"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Command-line tool for DigitalOcean
brew "doctl"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# CLI for templating and/or deploying FaaS functions
brew "faas-cli"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Zip password cracker
brew "fcrackzip"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line tools for fly.io services
brew "flyctl"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Distributed code review system for Git repos
brew "git-appraise"
# Highly customizable changelog generator
brew "git-cliff"
# Small git utilities
brew "git-extras"
# Bash-tool to store the private data inside a git repo
brew "git-secret"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Kubernetes package manager
brew "helm"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Display an interface's bandwidth usage
brew "iftop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# TUI for Kafka
brew "kaskade"
# Statically typed programming language for the JVM
brew "kotlin"
# Kubernetes command-line interface
brew "kubernetes-cli"
# TUI for logs from journalctl, file system, Docker, Podman and Kubernetes pods
brew "lazyjournal"
# Fast and powerful Git hooks manager for any type of projects
brew "lefthook"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# Deep clean and optimize your Mac
brew "mole"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Fast, highly customisable system info script
brew "neofetch"
# HTTP/2 C Library
brew "nghttp2"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Manage multiple Node.js versions
brew "nvm"
# AI coding agent, built for the terminal
brew "opencode"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Framework for layout and rendering of i18n text
brew "pango"
# Python dependency management tool
brew "pipenv"
# Tool for managing OCI containers and pods
brew "podman"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Python version management
brew "pyenv"
# Cross-platform application and UI framework
brew "qt"
# Rsync for cloud storage
brew "rclone"
# Utility that provides fast incremental file transfer
brew "rsync"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Safe, concurrent, practical language
brew "rust"
# Rust toolchain installer
brew "rustup"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli", link: false
# Shamir's secret sharing scheme implementation
brew "ssss"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# CLI for extracting streams from various websites to a video player
brew "streamlink"
# Version control system designed to be a better CVS
brew "subversion"
# Open source continuous file synchronization application
brew "syncthing", restart_service: :changed, link: false
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale", restart_service: :changed
# User interface to the TELNET protocol
brew "telnet"
# OpenTofu / Terraform / Terragrunt / Terramate / Atmos version manager
brew "tenv"
# Powerful free data recovery utility
brew "testdisk"
# Linter for Terraform files
brew "tflint"
# Terminal multiplexer
brew "tmux"
# Lightweight BitTorrent client
brew "transmission-cli"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Binary diff, differential compression tools
brew "xdelta"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# CLI app to manage your Apple Notes and Apple reminders
brew "antoniorodr/memo/memo", trusted: true
# Remove all the resources from an AWS account
brew "ekristen/tap/aws-nuke", trusted: true
# A fast, cross-platform build tool inspired by Make, designed for modern workflows.
brew "go-task/tap/go-task", trusted: true
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd", trusted: true
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun", trusted: true
# speedtest cli
brew "showwin/speedtest/speedtest", trusted: true
# Android SDK component
cask "android-platform-tools"
# Application uninstaller
cask "appcleaner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Terminal-based AI coding assistant
cask "claude-code"
# Clipboard extension app
cask "clipy"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Upload Docker images to remote servers via SSH without an external registry.
cask "psviderski/tap/docker-pussh"
# Finds duplicate files in a computer system
cask "dupeguru"
cask "font-fragment-mono"
cask "font-noto-serif"
cask "font-roboto"
cask "font-roboto-mono"
cask "font-roboto-mono-for-powerline"
# Disk partitioning tool
cask "gdisk"
# Disk space cleaner that finds and deletes duplicated and similar files
cask "gemini"
# Open-source video transcoder
cask "handbrake-app"
# Native instant workspace switching
cask "jurplel/tap/instant-space-switcher"
# Menu bar calendar
cask "itsycal"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# File archiver
cask "keka"
# Privacy-first, open-source platform for knowledge sharing and management
cask "logseq"
# File system integration
cask "macfuse"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Music player focusing on visuals
cask "plexamp"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# Real time file synchronisation software
cask "syncthing-app"
# Messaging app with a focus on speed and security
cask "telegram"
# Disposable email client
cask "tempbox"
# Unpacks archive files
cask "the-unarchiver"
# Open-source BitTorrent client
cask "transmission"
# Virtual machines UI using QEMU
cask "utm"
# Multimedia player
cask "vlc"
# Gecko based web browser
cask "zen"
