# @jaydenrasmussen

tap "aws/tap"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "go-task/tap/go-task"
tap "derailed/k9s/k9s"

brew "age"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bat"
brew "black"
brew "cfssl"
brew "clang-format"
brew "cloc"
brew "coreutils"
brew "deno"
brew "docker-compose"
brew "doctl"
brew "exiftool"
brew "ffmpeg"
brew "figlet"
brew "git"
brew "git-extras"
brew "git-secret"
brew "gnupg"
brew "go"
brew "go-task"
brew "golangci-lint"
brew "helm"
brew "highlight"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "k9s"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "kompose"
brew "kubernetes-cli"
brew "lefthook"
brew "minikube"
brew "mtr"
brew "nghttp2"
brew "nginx"
brew "nvm"
brew "openshift-cli"
brew "packer"
brew "pandoc"
brew "pipenv"
brew "pyenv"
brew "rust"
brew "tailscale"
brew "telnet"
brew "tfenv"
brew "tmux"
brew "tree"
brew "vendir"
brew "vim"
brew "vault"
brew "watch"
brew "wget"
brew "wrk"

cask "adapter"
cask "appcleaner"
cask "balenaetcher"
cask "clipy"
cask "coconutbattery"
cask "cryptomator"
cask "devutils"
cask "discord"
cask "docker"
cask "dupeguru"
cask "fantastical"
cask "firefox"
cask "font-fragment-mono"
cask "font-noto-serif"
cask "font-roboto"
cask "font-roboto-mono"
cask "go2shell"
cask "hammerspoon"
cask "hermes"
cask "itsycal"
cask "keka"
cask "league-of-legends"
cask "notion"
cask "netnewswire"
cask "obs"
cask "obsidian"
cask "onyx"
cask "postman"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "rectangle"
cask "signal"
cask "slack"
cask "sublime-merge"
cask "sublime-text"
cask "the-unarchiver"
cask "typora"
cask "veracrypt"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vlc"
cask "vscodium"
cask "zoom"
