tap "arkweid/lefthook"
tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "weaveworks/tap"
brew "automake"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bat"
brew "black"
brew "cfssl"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "composer"
brew "coreutils"
brew "direnv"
brew "docker-compose"
brew "docker-compose-completion"
brew "doctl"
brew "exiftool"
brew "figlet"
brew "git"
brew "git-extras"
brew "gnupg"
brew "git-secret"
brew "go"
brew "helm"
brew "highlight"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "jq"
brew "kompose"
brew "kubernetes-cli"
brew "kubeless"
brew "m-cli"
brew "mas"
brew "minikube"
brew "mtr"
brew "nghttp2"
brew "nginx"
brew "nvm"
brew "octant"
brew "openshift-cli"
brew "packer"
brew "pandoc"
brew "pyenv"
brew "rust"
brew "telnet"
brew "tfenv"
brew "the_silver_searcher"
brew "thefuck"
brew "tmux"
brew "vim"
brew "watch"
brew "wget"
brew "arkweid/lefthook/lefthook"
brew "aws/tap/aws-sam-cli"
cask "adapter"
cask "appcleaner"
cask "balenaetcher"
cask "battle-net"
cask "burn"
cask "clipy"
cask "coconutbattery"
cask "discord"
cask "docker"
cask "dropbox"
cask "dupeguru"
cask "evernote"
cask "firefox"
cask "flash-player"
cask "font-noto-serif"
cask "font-roboto"
cask "font-roboto-mono"
cask "go2shell"
cask "google-backup-and-sync"
cask "google-chrome"
cask "hammerspoon"
cask "hermes"
cask "itsycal"
cask "keka"
cask "kindle"
cask "league-of-legends"
cask "notion"
cask "obs"
cask "onyx"
cask "oracle-jdk"
cask "osxfuse"
cask "postman"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "sketch"
cask "slack"
cask "smcfancontrol"
cask "spotify"
cask "steam"
cask "sublime-merge"
cask "sublime-text"
cask "teamviewer"
cask "the-unarchiver"
cask "typora"
cask "unetbootin"
cask "veracrypt"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vlc"
cask "vscodium"
cask "zoomus"
mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
